{
  "appTitle": "Umineko Epitaph",
  "language": "Language",
  "changeLanguage": "Change Language",
  "currentLanguage": "Current Language: {{language}}",
  "navigation": {
    "home": "Home",
    "about": "About"
  },
  "epitaph": {
    "title": "Witch's Epitaph",
    "1": "Behold the sweetfish river, running through my beloved home of old.",
    "2": "You who seek the Golden Land, follow its path downstream in search of the key.",
    "3": "As you travel down it, you will see a village.",
    "4": "In that village, look for the shore the two speak of.",
    "5": "There the key to the Golden Land sleeps.",
    "6": "You who laid hand upon the key must journey as follows to the Golden Land.",
    "7": "On the first twilight, sacrifice the six chosen by the key.",
    "8": "On the second twilight, those who remain shall tear apart the two who are close.",
    "9": "On the third twilight, those who remain shall praise my noble name.",
    "10": "On the fourth twilight, gouge the head and kill.",
    "11": "On the fifth twilight, gouge the chest and kill.",
    "12": "On the sixth twilight, gouge the stomach and kill.",
    "13": "On the seventh twilight, gouge the knee and kill.",
    "14": "On the eighth twilight, gouge the leg and kill.",
    "15": "On the ninth twilight, the witch revives, and none shall be left alive.",
    "16": "On the tenth twilight, the journey ends, and you shall reach the Home of the Gold.",
    "17": "The witch shall praise the wise, and bestow four treasures.",
    "18": "One shall be all of the Golden Land's gold.",
    "19": "One resurrects all the dead people's souls.",
    "20": "One even revives all the love they possessed.",
    "21": "And one for the witch to eternally rest.",
    "22": "Rest in peace, my beloved witch, Beariche."
  },
  "pages": {
    "home": {
      "title": "Home",
      "description": "Welcome to our multilingual React application",
      "welcomeTitle": "Welcome",
      "welcomeMessage": "This is a modern React application with multi-language support and client-side routing.",
      "featuresTitle": "Key Features",
      "feature1": "React 19 + TypeScript support",
      "feature2": "Multi-language internationalization (Chinese, English, Japanese)",
      "feature3": "Client-side routing navigation"
    },
    "about": {
      "title": "About",
      "description": "Learn more about this project",
      "projectTitle": "Project Introduction",
      "projectDescription": "This is a multilingual React application example built with modern frontend technology stack.",
      "technologiesTitle": "Technologies Used",
      "featuresTitle": "Features",
      "feature1": "Responsive design",
      "feature2": "Multi-language support",
      "feature3": "Type-safe routing",
      "feature4": "Modern development experience",
      "version": "Version"
    },
    "quadrillion":{
      "title":"Quadrillion"
    },
    "goldenLand":{
      "title":"Golden Land"
    },
    "notFound": {
      "title": "Page Not Found",
      "description": "Sorry, the page you are looking for does not exist",
      "message": "The page you are looking for might have been removed, renamed, or is temporarily unavailable.",
      "backToHome": "Back to Home"
    }
  }
}
